app/Controllers/Login.php

SELECT *
FROM `userlogin`
WHERE `email` = 'adminhydrogen@gmail.com'
 LIMIT 1
---
    public function create()
    {
        try {
            $validate = $this->validate([
                'email' => 'required',
                'password' => 'required',
            ], [
                "email" => [
                    "required" => "Email harus diisi!",
                ],
                "password" => [
                    "required" => "Anda harus mengisi kata sandi!",
                ],
            ]);

            if(!$validate) {
                session()->setFlashData("errors", $this->validator->listErrors());
                return redirect()->to(previous_url())->withInput();
            }

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $this->userlogin
                    ->where('email', $email)
                    ->first();

SELECT *
FROM `userlogin`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `userlogin`
---
    public function daftarpengguna (){
        $user = $this->userlogin->paginate(10, 'user');